tap "ankitpokhrel/jira-cli"
tap "charmbracelet/tap"
tap "facebook/fb"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "leoafarias/fvm"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Cross-platform make
brew "cmake"
# C library implementing the SSH2 protocol
brew "libssh2"
# Open source suite of directory software
brew "openldap"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# More intuitive version of du in rust
brew "dust"
# Utilities for the ext2, ext3, and ext4 file systems
brew "e2fsprogs"
# Run arbitrary commands when files change
brew "entr"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Modern replacement for 'ls'
brew "exa"
# YAML Parser
brew "libyaml"
# Powerful, clean, object-oriented scripting language
brew "ruby@3.1"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Easiest way to build and release mobile apps
brew "fastlane"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Console program to recover files based on their headers and footers
brew "foremost"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Next-gen compiler infrastructure
brew "llvm"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit", args: ["HEAD"]
# Package manager for the Lua programming language
brew "luarocks"
# Text-based web browser
brew "lynx"
# NCurses Disk Usage
brew "ncdu"
# HTTP/2 C Library
brew "nghttp2"
# Small build system for use with gyp or CMake
brew "ninja"
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@16"
# Object-relational database system
brew "postgresql@14"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Zephyr meta-tool
brew "west"
# General-purpose lossless data-compression library
brew "zlib"
# Additional completion definitions for zsh
brew "zsh-completions"
# 🔥 Feature-rich interactive Jira command-line
brew "ankitpokhrel/jira-cli/jira-cli"
# GPT-4 on the command line
brew "charmbracelet/tap/mods"
# A Powerful Command Line for automating iOS Simulators
brew "facebook/fb/idb-companion"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# GPU-accelerated terminal emulator
cask "alacritty"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-iosevka-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-sauce-code-pro-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-victor-mono-nerd-font"
# GPU-based terminal emulator
cask "kitty"
vscode "Avetis.tokyo-night"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "fivethree.vscode-fastlane-snippets"
vscode "golang.go"
vscode "GrapeCity.gc-excelviewer"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-execution"
vscode "GraphQL.vscode-graphql-syntax"
vscode "humao.rest-client"
vscode "inci-august.august-themes"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jock.svg"
vscode "luanpotter.dart-import"
vscode "mathiasfrohlich.Kotlin"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "mvllow.rose-pine"
vscode "Nash.awesome-flutter-snippets"
vscode "phplasma.csv-to-table"
vscode "rebornix.ruby"
vscode "redhat.java"
vscode "ritwickdey.LiveServer"
vscode "spadin.zmk-tools"
vscode "sumneko.lua"
vscode "teabyii.ayu"
vscode "twxs.cmake"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wicked-labs.wvsc-serendipity"
vscode "wingrunr21.vscode-ruby"
